# Задание № 1:
# Создать файл my.sql, в котором должна создаваться таблица с информацией об одногруппниках. 
# В таблице должно быть четыре поля: id, name, age, address. Все поля в таблице обязательны для заполнения.

# Необходимо добавить 5-10 одногруппников в данную таблицу.
# Необходимо написать запрос на получение имен всех одногруппников (только имен, без всего остального), 
# которые живут в Москве и их возраст находится в диапазоне [18, 30) лет.

CREATE SCHEMA `task_2` ;
USE task_2;

CREATE TABLE `phoneBook` (
  `id` INT NOT NULL AUTO_INCREMENT,
  `name` VARCHAR(20) NOT NULL,
  `age` INT NOT NULL,
  `address` VARCHAR(45) NOT NULL,
  PRIMARY KEY (`id`));
  
INSERT phoneBook (name, age, address) 
VALUES ('Иван', 16, 'Волгоград'), 
('Сергей ', 18, 'Москва'), 
('Анна', 20, 'Токио'), 
('Андрей', 30, 'Москва'),
('Ольга', 40, 'Калининград'),  
('Дмитрий', 50, 'Саки');

SELECT name AS Имя 
FROM phoneBook
WHERE (age >= 18 OR age < 30) AND address = 'Москва';