// Необходимо создать html-страницу с названием index.html, в которой подключить файл main.js (его тоже необходимо создать рядом с html-файлом). 
// В js-файле необходимо создать следующий скрипт:
// Cоздать функцию greeting, которая принимает в качестве параметра имя человека и выводит приветствие, используя переданное ей имя, в консоль.
// Необходимо продемонстрировать работу функции: у пользователя запросить его имя и вызвать функцию greeting, 
// передав туда полученное от пользователя значение.

const clientName = prompt("Введите Ваше имя");
hello(clientName);

// Метод вывода приветствия в зависимости от времени суток
function hello(name) {
    var MyDate = new Date;
    MyHours = MyDate.getHours();
    if ((MyHours >= 5 && MyHours < 11)) {
        alert(`Доброе утро, ${name}`);
    } else if (MyHours >= 11 && MyHours < 16) {
        alert(`Добрый день, ${name}`);
    } else if (MyHours >= 16 && MyHours <= 23) {
        alert(`Добрый вечер, ${name}`);
    } else if (MyHours >= 0 && MyHours < 5) {
        alert(`Доброй ночи, ${name}`);
    } else {
        alert(`Здравствуйте, ${name}`);
    }
}
